/**
*	IPv4関係	グローバル宣言と初期化
*	Copyright (c)Junnichi Tomaru
*/

/* ----- ネットワーク関連 ----- */
/* 共通 */
ether_t	pacinfo = { 0U, { 0,0,0,0,0,0 }, 0UL, 0UL, 0U, 0U, 0U, 0U, 0UL };	/* パケット情報 */
pseudo_st	pseudo_hdr ={ 0UL, 0UL, 0, 0, 0U };	/* 擬似ヘッダ */

/* 下位レイヤー */
byte	mac_address[6] = { 0, 0, 0, 0, 0, 0 };	/* MACアドレス */
arp_tb	arp_cache[8] = {	/* ARPキャッシュテーブル */
	{ 0UL, { 0,0,0,0,0,0 }, 0UL, 0 }, { 0UL, { 0,0,0,0,0,0 }, 0UL, 0 },
	{ 0UL, { 0,0,0,0,0,0 }, 0UL, 0 }, { 0UL, { 0,0,0,0,0,0 }, 0UL, 0 },
	{ 0UL, { 0,0,0,0,0,0 }, 0UL, 0 }, { 0UL, { 0,0,0,0,0,0 }, 0UL, 0 },
	{ 0UL, { 0,0,0,0,0,0 }, 0UL, 0 }, { 0UL, { 0,0,0,0,0,0 }, 0UL, 0 }
};
byte	arp_tp = 0;		/* ARPテーブルポインタ */
dword	arp_timeout = ARP_TIMEMAX;	/* ARPキャッシュタイムアウト */
word	arp_reqtimeout = 2000U;	/* ARP要求返答タイムアウト */

/* 上位レイヤー */
/* --- IP --- */
dword	myipaddr = 0UL;		/* 自分のIPアドレス */
dword	netmask = 0UL;		/* サブネットマスク */
dword	gateway = 0UL;		/* デフォルトゲートウェイ */
word	ip_identifer = 0U;	/* IP識別ID */
byte	ip_hdrlen = 0;		/* IPヘッダ長 */
byte	ip_ttl = 0x40;		/* TTL */

/* --- ICMP --- */
byte	icmptype = 0;		/* メッセージタイプ */
byte	icmpcode = 0;		/* メッセージコード */
dword	icmpopt = 0UL;		/* オプション */

/* --- TCP --- */
tsock_t	sock_tbl[TCPSOCK_MAX] = {	/* TCPソケット */
	{ LISTEN, 0UL, 0U, 0U, 0UL, 0UL, 0U }, { LISTEN, 0UL, 0U, 0U, 0UL, 0UL, 0U }
};

/* --- HTTP --- */
word	http_port = 0U;		/* HTTP使用ポート */
tsock_t	*tstmp = NULL;
char	cgibuf1[CGIBUFSIZE] = 	/* CGI処理バッファ1 */
{
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
};
char	cgibuf2[CGIBUFSIZE] = 		/* CGI処理バッファ2 */
{
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
};
swbool	httpen[2] = { off, off };	/* HTTPデータ有効 */
byte	cgien[2] = { CGI_NONE, CGI_NONE };	/* GET,HEADメソッドを受信した */

/* --- NTP --- */
dword	ntpserver = 0UL;	/* 問い合わせ先NTPサーバ */
char	ntpsrv1[32] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };/* NTPサーバ設定1 */
char	ntpsrv2[32] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };/* NTPサーバ設定2 */
char	ntpsrv3[32] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };/* NTPサーバ設定3 */
char	ntpsrv4[32] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };/* NTPサーバ設定4 */
byte	srvpnt = 0;		/* 問い合わせ先NTPサーバ位置 */
byte	osrvpnt = 0;		/* 旧問い合わせ先NTPサーバ位置 */
int	calsec = 0;		/* 補正秒 */
int	calms = 0;		/* 補正ミリ秒 */
dword	ntpbcipadr = 0UL;	/* NTPブロードキャストIPアドレス */
dword	rootdly = 0UL;		/* ルート遅延 */
dword	rootdsprsn = 0UL;	/* ルート拡散 */
dword	txstamp = 0UL;		/* 送信時刻(参照識別子用) */
time_t	rxstamp = 0L;		/* パケット受信時刻(秒) */
time_t	rnstamp = 0L;		/* 更新時刻(秒) */
word	rxtime = 0U;		/* 1msごとパケット受信カウント値 */
word	rntime = 0U;		/* 1msごと更新時カウント値 */
word	ntpstart = 0U;		/* NTP要求時間 */
word	ntptout = 0U;		/* タイムアウト時間 */
word	binterval = 0U;		/* ブロードキャスト間隔(秒,0,65535:無効) */
int	cinterval = 0;		/* チェック間隔 */
byte	lists = LI_ALARM;	/* LI状態 */
byte	stratum = 16;		/* 初期stratum16(同期してないので) */
byte	ntprtrycnt = 0;		/* タイムアウト時リトライカウント */
word	timewidth = 0U;		/* 補正許容範囲(±sec)、0=無効 */
int	slew_ms = 0;		/* slew補正ミリ秒 */
int	slew_width = 0;		/* slew判定ミリ秒 */

/* --- DHCP --- */
dword	tmp_ipaddr = 0UL;	/* 仮IPアドレス(初期化しない) */
dword	tmp_netmask = 0UL;	/* 仮ネットマスク */
dword	tmp_gateway = 0UL;	/* 仮ゲートウェイ */
dword	tmp_server = 0UL;	/* 仮DHCPサーバ */
dword	tmp_dns = 0UL;		/* 仮DNSサーバ */
dword	tmp_renewal = 0UL;	/* 仮RENEW時間 */
dword	tmp_rebind = 0UL;	/* 仮REBIND時間 */
dword	tmp_lease = 0UL;	/* 仮リースタイム */

dword	dhcp_xid = 0UL;		/* トランザクションID */
struct tm	odcvr_time = { 0,0,9,1,0,70,0,0,0 };	/* DISCOVER開始時間 */
time_t	renewal_time = 0L;	/* DHCP RENEW時間 */
time_t	rebind_time = 0L;	/* DHCP REBIND時間 */
time_t	lease_time = 0L;	/* DHCPリースタイム */
time_t	ddcrem = 0L;		/* DHCP DISCOVERリトライ時間残り */
word	dinterval = 0U;		/* DHCP要求インターバル(秒,0,65535:無効) */
byte	dhcp_msgtype = 0;	/* メッセージタイプ */
byte	dhcp_mode = DHCP_ABORT;	/* DHCP状態 */
swbool	dhcpcnten = off;	/* リースタイムカウント許可 */
byte	dhcp_cnt = 0;		/* リトライカウント */

/* --- リゾルバ --- */
char	rslvname[32] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };
cache_t	cache_table[DNS_CACHE_MAX] =	/* NAMEキャッシュ */
{
	{{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, 0L, 0L, 0 },
	{{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, 0L, 0L, 0 },
	{{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, 0L, 0L, 0 },
	{{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, 0L, 0L, 0 },
	{{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, 0L, 0L, 0 },
	{{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, 0L, 0L, 0 },
	{{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, 0L, 0L, 0 },
	{{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, 0L, 0L, 0 }
};
word	rslv_start = 0U;	/* リゾルバ問い合わせ時刻(タイムアウト) */
word	rslv_xid = 0U;		/* リゾルバトランザクションID */
dword	rslv_addr = 0UL;	/* リゾルバ結果アドレス */
byte	rslv_tp = 0;		/* リゾルバテーブルポインタ */
byte	rslv_cnt = 0;		/* リゾルバリトライ回数 */
byte	rslv_req = 0;		/* 名前問い合わせ中 */
swbool	rslv_end = off;		/* 解決終了フラグ 1 */

/* --- NBNS --- */
char	nbns_name[16] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };	/* NetBIOS名 */

/* --- DNS --- */
dword	dns_server = 0UL;	/* DNSサーバアドレス */

/* end of ipv4_inival.c */
